---
kind: method
id: M:Autodesk.Revit.DB.PolylineSegments.Dispose
source: html/12132b5b-f8a5-1b49-0c53-dfbd60029759.htm
---
# Autodesk.Revit.DB.PolylineSegments.Dispose Method

Releases all resources used by the PolylineSegments

## Syntax (C#)
```csharp
public void Dispose()
```